src/InformationRegisters/ГрафикиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиЗаказов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДниНедели</Name>
					<Comment>Дни недели в которые формируется заказ: Пн,Вт,Ср,Чт,Пт,Сб,Вс (1,2,3,4,5,6,7)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДниНеделиПоставки</Name>
					<Comment>Дни недели в которые оформляется поставка: Пн,Вт,Ср,Чт,Пт,Сб,Вс (1,2,3,4,5,6,7)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неделя</Name>
					<Comment>0 - Каждая, 2 - Четная, 1 - НеЧетная</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Периодичность</Name>
					<Comment>Периодичность заказа (ежедневно, еженедельно, ежемесячно, раз в указанное количество дней)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставки</Name>
					<Comment>Срок поставки (за сколько дней делать заказ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормированиеЗаказаВЦО</Name>
					<Comment>Признак формирование заказа в ЦО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПринятияЗаказа</Name>
					<Comment>Время, до которого поставщик принимает заказ (внутри дня)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выходные</Name>
					<Comment>Выходные (дни, когда отгрузка поставщиком не выполняется)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГрафикПоставок</Name>
					<Comment>Истина - график поставок; Ложь - график заказов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасыПриемаНаМагазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнтервалыВремениСуток</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраховойЗапас</Name>
					<Comment>в днях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчета</Name>
					<Comment>0 - Рассчитывать по среднему выбытию; 1 - По рассчитанному выбытию; 2 - По рассчитанному среднему выбытию;</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОграниченияЗаписи</Name>
					<Comment>Задача № 319345 после этого времени заказ даже не запишется</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопПризнак</Name>
					<Comment>Дополнительный признак разделения графика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/УстановкаГрафикаЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>УстановкаГрафикаЗаказов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГрафикиЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДниНедели</Name>
							<Comment>Дни недели в которые формируется заказ: Пн,Вт,Ср,Чт,Пт,Сб,Вс (1,2,3,4,5,6,7)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДниНеделиПоставки</Name>
							<Comment>Дни недели в которые осуществляется поставка: Пн,Вт,Ср,Чт,Пт,Сб,Вс (1,2,3,4,5,6,7)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неделя</Name>
							<Comment>Каждая,Четная,НеЧетная(0,2,1)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Периодичность</Name>
							<Comment>Периодичность заказа (ежедневно, еженедельно, ежемесячно, раз в указанное количество дней)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПоставки</Name>
							<Comment>Срок поставки (за сколько дней делать заказ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормированиеЗаказаВЦО</Name>
							<Comment>Признак формирование заказа в ЦО</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПринятияЗаказа</Name>
							<Comment>Время, до которого поставщик принимает заказ (внутри дня)</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выходные</Name>
							<Comment>Выходные (дни, когда отгрузка поставщиком не выполняется)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГрафикПоставок</Name>
							<Comment>Истина - график поставок; Ложь - график заказов</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасыПриемаНаМагазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнтервалыВремениСуток</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховойЗапас</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантРасчета</Name>
							<Comment>0 - Рассчитывать по среднему выбытию; 1 - По рассчитанному выбытию; 2 - По рассчитанному среднему выбытию;</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубПоставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СегментНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопПризнак</Name>
							<Comment>Дополнительный признак разделения графика</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОграниченияЗаписи</Name>
							<Comment>Задача № 319345 после этого времени заказ даже не запишется</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ГрафикиЗаказов/Ext/RecordSetModule.bsl
// Модуль набора записей регистра "Графики заказов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

Перем ДокументОбъект Экспорт;  // документ объект для записи
Перем Контрагент     Экспорт;  // Контрагент
Перем Подразделение  Экспорт;  // Подразделение
Перем РезультатЗапросаПоТоварам Экспорт;	// РезультатЗапроса или ТаблицаЗначений. Устанавливается если документ имеет "необычную" ТЧ
Перем ДатаНачалаДействия Экспорт;   // дата начала действия

#КонецОбласти

// получаем таблицу графика
Функция ПолучитьТаблицуТоваров()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	МИНИМУМ(ДокументТовары.НомерСтроки) КАК НомерСтроки,
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.СегментНоменклатуры КАК СегментНоменклатуры,
	|	ДокументТовары.Подразделение КАК Подразделение,
	|	ДокументТовары.Контрагент КАК Контрагент,
	|	ДокументТовары.ДниНедели КАК ДниНедели,
	|	ДокументТовары.ДниНеделиПоставки КАК ДниНеделиПоставки,
	|	ДокументТовары.Неделя КАК Неделя,
	|	ДокументТовары.Периодичность КАК Периодичность,
	|	ДокументТовары.СрокПоставки КАК СрокПоставки,
	|	ДокументТовары.ФормированиеЗаказаВЦО КАК ФормированиеЗаказаВЦО,
	|	ДокументТовары.ЭтоГрафикПоставок КАК ЭтоГрафикПоставок,
	|	ДокументТовары.ВремяПринятияЗаказа КАК ВремяПринятияЗаказа,
	//++ ситников Задача № 319345
	|	ДокументТовары.ВремяОграниченияЗаписи КАК ВремяОграниченияЗаписи,
	//--
	|	ДокументТовары.ЧасыПриемаНаМагазин КАК ЧасыПриемаНаМагазин,
	|	ДокументТовары.СтраховойЗапас КАК СтраховойЗапас,
	|	ДокументТовары.Выходные КАК Выходные,
	|	ДокументТовары.ВариантРасчета КАК ВариантРасчета,
	|	ДокументТовары.СубПоставщик КАК СубПоставщик,
	|	ДокументТовары.ДопПризнак КАК ДопПризнак,
	|	ДокументТовары.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.УстановкаГрафикаЗаказов.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.СегментНоменклатуры,
	|	ДокументТовары.Подразделение,
	|	ДокументТовары.Контрагент,
	|	ДокументТовары.ДниНедели,
	|	ДокументТовары.ДниНеделиПоставки,
	|	ДокументТовары.Неделя,
	|	ДокументТовары.Периодичность,
	|	ДокументТовары.СрокПоставки,
	|	ДокументТовары.ФормированиеЗаказаВЦО,
	|	ДокументТовары.ЭтоГрафикПоставок,
	|	ДокументТовары.ВремяПринятияЗаказа,
	//++ ситников Задача № 319345
	|	ДокументТовары.ВремяОграниченияЗаписи,
	//--
	|	ДокументТовары.ЧасыПриемаНаМагазин,
	|	ДокументТовары.СтраховойЗапас,
	|	ДокументТовары.Выходные,
	|	ДокументТовары.ВариантРасчета,
	|	ДокументТовары.СубПоставщик,
	|	ДокументТовары.ДопПризнак,
	|	ДокументТовары.Комментарий");
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //ПолучитьТаблицуТоваров()

Функция ПроверитьНаОдинаковыеЗаписи(ТаблицаТоваров)
	
	Результат = Истина;
	
	ТаблицаКопия = ТаблицаТоваров.Скопировать();
	ТаблицаКопия.Колонки.Добавить("КоличествоПовторов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаКопия.ЗаполнитьЗначения(1, "КоличествоПовторов");
	
	// Будем сворачивать таблицу. Сначала сформируем строку сворачивания.
	ТаблицаКопия.Свернуть("Подразделение,Контрагент,СубПоставщик,Номенклатура,СегментНоменклатуры,ДопПризнак", "КоличествоПовторов");
	
	Ошибки = НСтр("ru = 'Ошибка.'") + НСтр("ru = 'Графики заказов '") + НСтр("ru = 'попытка назначения одинаковых графиков заказов для следующих позиций:'");
	Для Каждого ТекСтрокаТЗ Из ТаблицаКопия Цикл  	
		Если ТекСтрокаТЗ.КоличествоПовторов > 1 Тогда
			Результат   = Ложь;
			Ошибки = Ошибки + Символы.ПС + " - " + "Номенклатура" + " <" + ТекСтрокаТЗ.Номенклатура + ">";
		КонецЕсли;
	КонецЦикла;
	
	Если Не Результат Тогда
		ВывестиСообщение(Ошибки,ДокументОбъект,,,Истина);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПроверитьНаОдинаковыеЗаписи() 

// Функция производит установку графика заказов.
Функция УстановитьГрафикЗаказа() Экспорт
	
	// заполним незаполненные переменные.
	ДатаНачалаДействия = ?(ТипЗнч(ДатаНачалаДействия) = Тип("Дата"), ДатаНачалаДействия, ДокументОбъект.Дата);
	
	// Получаем таблицу товаров. Независимо как будет получена данная таблица, названия колонок должны быть стандартными.
	Если (РезультатЗапросаПоТоварам = Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоТоварам)<> Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоТоварам)<>Тип("ТаблицаЗначений")) Тогда
		// Получаем таблицу.
		РезультатЗапросаПоТоварам = ПолучитьТаблицуТоваров();
	Иначе
		// Список необходимых движений по графикам пришел извне. Проверим, таблица значений ли это.
		Если ТипЗнч(РезультатЗапросаПоТоварам) = Тип("РезультатЗапроса") Тогда
			РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам.Выгрузить();
		КонецЕсли;
	КонецЕсли;
	
	// Проверим повторную установку однго и того же графика.
	Если Не ПроверитьНаОдинаковыеЗаписи(РезультатЗапросаПоТоварам) Тогда
		РезультатЗапросаПоТоварам = Неопределено; 
		
		// Убиваем циклическую ссылку.
		ДокументОбъект = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	
	// Устанавливаем график
	Результат = Истина;
	Для Каждого СтрокаТовар Из РезультатЗапросаПоТоварам Цикл
		
		НоваяЗапись = Добавить();
		НоваяЗапись.Период					= ДатаНачалаДействия;
		НоваяЗапись.Регистратор				= ДокументОбъект.Ссылка;
		НоваяЗапись.Подразделение			= СтрокаТовар.Подразделение;
		НоваяЗапись.Контрагент				= СтрокаТовар.Контрагент;
		НоваяЗапись.Номенклатура			= СтрокаТовар.Номенклатура;
		НоваяЗапись.СегментНоменклатуры		= СтрокаТовар.СегментНоменклатуры;
		НоваяЗапись.ДниНедели				= СтрокаТовар.ДниНедели;
		НоваяЗапись.ДниНеделиПоставки		= СтрокаТовар.ДниНеделиПоставки;
		НоваяЗапись.Неделя					= СтрокаТовар.Неделя;
		НоваяЗапись.Периодичность			= СтрокаТовар.Периодичность;
		НоваяЗапись.СрокПоставки			= СтрокаТовар.СрокПоставки;
		НоваяЗапись.ФормированиеЗаказаВЦО	= СтрокаТовар.ФормированиеЗаказаВЦО;
		НоваяЗапись.ВремяПринятияЗаказа		= СтрокаТовар.ВремяПринятияЗаказа;
		НоваяЗапись.Выходные				= СтрокаТовар.Выходные;
		НоваяЗапись.ЭтоГрафикПоставок		= СтрокаТовар.ЭтоГрафикПоставок;
		НоваяЗапись.ЧасыПриемаНаМагазин		= СтрокаТовар.ЧасыПриемаНаМагазин;
		НоваяЗапись.СтраховойЗапас			= СтрокаТовар.СтраховойЗапас;
		НоваяЗапись.ВариантРасчета			= СтрокаТовар.ВариантРасчета;
		НоваяЗапись.СубПоставщик			= СтрокаТовар.СубПоставщик;
		НоваяЗапись.ДопПризнак				= СтрокаТовар.ДопПризнак;
		НоваяЗапись.Комментарий				= НоваяЗапись.Комментарий;
		
		//++ ситников Задача № 319345
		НоваяЗапись.ВремяОграниченияЗаписи  = СтрокаТовар.ВремяОграниченияЗаписи;
		//--
	КонецЦикла;
	
	// Скинем некоторые переменные
	РезультатЗапросаПоТоварам	= Неопределено;
	ДатаНачалаДействия			= Неопределено;
	
	// Убиваем циклическую ссылку
	ДокументОбъект = Неопределено;
	
	Возврат Результат;
	
КонецФункции //УстановитьГрафикЗаказа()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для формирования наименования/кода нового элемента.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередЗаписью(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()


#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ



//////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ
//////////////////////////////////////////////////////////////////////////////////

Контрагент					= Справочники.Контрагенты.ПустаяСсылка();
Подразделение				= Справочники.ПодразделенияКомпании.ПустаяСсылка();

#КонецОбласти

#КонецЕсли
